import com.drew.imaging.ImageProcessingException;

import java.io.File;
import java.io.IOException;
import java.nio.file.Files;
import java.util.Objects;

public class AbstractTest {


   public static void main(String[] args) throws IOException, ImageProcessingException {
      String[] titles = new String[]{
              "(1) يتلونه حق تلاوته",
              "(2) ولله المشرق والمغرب 1",
              "(3) ولله المشرق والمغرب 2",
              "(4) وعلم آدم الأسماء كلها",
              "(5) ورد الآخرة", "(6) واتقوا يوما",
              "(7) وإياك نستعين",
              "(8) وأقيموا الصلاة وآتوا الزكاة",
              "(9) وآمنوا بما أنزلت",
              "(10) مفهوم التبديل القولي والعملي",
              "(11) هو الذي خلق لكم ما في الأرض جميعا",
              "(12) هدي المتقين",
              "(13) نعمة الهداية",
              "(14) نبذ الكتاب",
              "(15) من معاني الألوهية النسخ",
              "(16) من خالص التوحيد المعرفة بالله",
              "(17) من أسرار تنزيل الكتاب",
              "(18) ملك يوم الدين",
              "(19) مقدمة عامة عن سورة البقرة",
              "(20) مفهوم الحمد التعبدي",
              "(21) مسخ النفس",
              "(22) مساجد الله",
              "(23) مرض الهوى",
              "(24) مرض النفاق",
              "(25) مرض الكفر",
              "(26) مرض التكذيب",
              "(27) مرض الاستكبار",
              "(28) مثل البعوضة في القرآن",
              "(29) صمام الأمان من السحر وتأثيره",
              "(30) فويل للذين يكتبون الكتاب بأيديهم",
              "(31) لا تقولوا راعنا",
              "(32) كيف تكفرون بالله",
              "(33) كلمات التوية",
              "(34) فمن تبع هداي",
              "(35) فإن لم تفعلوا ولن تفعلوا",
              "(36) عهد الذكر",
              "(37) علم الآخرة",
              "(38) صفات اليهود",
              "(39) روح إقامة الصلاة",
              "(40) ذكر النعمة",
              "(41)  ذكر الأسماء",
              "(42) خطر تبعيض الكتاب",
              "(43) خطر الاستدراك على الله",
              "(44) حلية العبودية",
              "(45) حقيقة السحر",
              "(46) حق الخالقية",
              "(47) حسدا من عند أنفسهم 1",
              "(48) حسدا من عند أنفسهم 2",
              "(49) ثم قست قلوبكم",
              "(50) بصيرة دعاء الفاتحة 1",
              "(51) بصيرة دعاء الفاتحة 2",
              "(52) بصيرة الهداية والصراط المستقيم",
              "(53) بركاة الصلاة والزكاة",
              "(54) باب الرحمة",
              "(55) الوفاء بعهد 1",
              "(56) الوفاء بعهد 2",
              "(57) الندية",
              "(58) المدرسة الإبراهيمية 1",
              "(59) المدرسة الإبراهيمية 2",
              "(60) المال والحياة",
              "(61) العهد الموثق",
              "(62) الصفات النفسية للصلاة",
              "(63)الزلة مصيبة",
              "(64) الذين يقيمون الصلاة",
              "(65) الخشوع خشية",
              "(66) التحريف",
              "(67) الأمر التعبدي",
              "(68) إياك نعبد 1",
              "(69) إياك نعبد 2",
              "(70) إني جاعل في الأرض خليفة",
              "(71) فتطمعون أن يؤمنوا لكم",
              "(72) آداب السؤال",
              "(73) أخذ الميثاق",
              "(74) آيات النسخ منهج تربوي",
              "(75) وقالقوا لن يدخل الجنة إلا من كان هودا أو نصارى",
              "(76) الخير والفضل والرحمة على المسلمين",
              "(77) مرض الكبر",
              "(78) حاجتنا إلى إكتشاف معدن القرآن",
              "(79) تزكية النفس",
              "(80) بلاغات الرسالة القرآنية"
      };
      System.out.println(titles.length);


      File dirc = new File("P:\\محاضرات\\siisila");
      int i = 0;
      for (File fl : Objects.requireNonNull(dirc.listFiles())) {
         File newFile = new File(fl.getParent(), titles[i++] + ".mp3");
         Files.move(fl.toPath(), newFile.toPath());
         System.out.println(fl);
         System.out.println(newFile);
         System.out.println();
      }
   }
}
